Revit 2026 API

# PrintManagerSubmitPrint Method

---

Print the views and sheets defined in the current local PrintManager settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool SubmitPrint()
```
```vb
Public Function SubmitPrint As Boolean
```
```cpp
public:
bool SubmitPrint()
```
```fsharp
member SubmitPrint : unit -> bool
```

#### Return Value

BooleanTrue if successful, otherwise False.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when this operation is not allowed in the current application mode, or the print resource is occupied by others. |

PrintManager will apply the local settings to global and print the view/views/sheets which user defined with the current settings.

#### Reference

PrintManager Class

SubmitPrint Overload

Autodesk.Revit.DB Namespace